Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The 2013 system has been deprecated by Microsoft and should only be used for titles already in development \nThe 2017 system no longer requires a service manifest \nPlease see Microsoft documentation for more details
zh_cn: 2013年系统已被Microsoft弃用，只应用于已在开发的标题\n 2017系统不再需要服务清单\n请参阅Microsoft文档了解更多详细信息

source: The Colour preferences are used to change how the code and script editor display different texts.
zh_cn: 颜色偏好设置用于更改代码和脚本编辑器如何显示不同的文本。

source: The Confirm Dialogs preferences are used to change the messages that are shown in the room editor when you perform certain actions.
zh_cn: 确认对话框偏好设置用于更改房间编辑器执行某些操作时消息框设置。

source: The Drag and Drop Preferences are used to define how the Drag and Drop script editor looks and feels.
zh_cn: 拖拽按钮设置用于定义拖拽按钮脚本编辑器的外观。

source: The Expression input field is for you to input the ID of a specific instance that you want the action to work on.
zh_cn: 表达式（Expression）输入字段供你输入一个你希望执行动作的实例id。

source: The Extension Editor Preferences cover a few options related to the messages that you are shown when using it, with the exact details outlined below:
zh_cn: 扩展编辑器的偏好设置涵盖了一些和使用它时显示的信息有关的选项，具体有下面几个：

source: The Game Options resource are comprised of a series of different options for the project as a whole and for each target platform that you wish to export to.
zh_cn: 游戏选项 资源由整个项目和您希望导出的每个目标平台的一系列不同选项组成。

source: The General Preferences are used to define the general behaviour of the GameMaker Studio 2 IDE.
zh_cn: 常规偏好设置 被用于定义GameMaker Studio 2 IDE的常规行为。

source: The Grid Settings preferences are used to change how the grid overlay works, with the following options available:
zh_cn: 网格设置（Grid Settings） 偏好设置用来更改网格覆盖的工作方式，有下面可用的选项：

source: The Image Editor Preferences are used to define how the sprite and image editor windows look and feel.
zh_cn: 图像编辑器偏好设置（Image Editor Preferences）被用于定义精灵和 图像编辑器（Image Editor）窗口的外观和感受。

source: The Language Preferences are used to define how some of the language features for programming will be displayed in the IDE of GameMaker Studio 2 .
zh_cn: 语言偏好设置被用于定义编程时的一些语言特性将会被如何显示在 GameMaker Studio 2 的 IDE 中。

source: The Marketplace Preferences are used to set up the Marketplace Certificate for uploading or buying assets.
zh_cn: The 市场偏好设置（Marketplace Preferences）可以建立在市场上用于上传或购买资源的市场证书（Marketplace Certificate）。

source: The Master Runtime Feed preferences are used to select, install and un-install the different runtime tools (this page will be the same too for any further runtime feeds that you have added).
zh_cn: 主运行库下载源偏好设置用于选择、安装或者卸载不同的运行库工具（此页对于你添加的任何其它的运行库下载源也都是一样的）。

source: The Object Editor Preferences are used to define certain properties for the object editor window.
zh_cn: 物体编辑器偏好设置 用于定义 物体编辑器 窗口的特定属性。

source: The Plugins Preferences are used to control any extra plugins that have been added to the GameMaker Studio 2 IDE.
zh_cn: 插件偏好设置用于控制已经添加到GameMaker Studio 2 IDE的任何额外的插件。

source: The Preferences Window is an essential part of GameMaker Studio 2, as it is where you can set up and customise your experience using the IDE as well as set up any specific platform SDK's etc...
zh_cn: 偏好设定窗口 是 GameMaker Studio 2的一个重要的组成部分，因为在这里你能够设置并自定义你的IDE使用体验还可以设置任意平台的SDK等……

source: The Resource Tree Preferences are used to define certain properties for how the resource tree and it's elements function.
zh_cn: 资源树偏好设置用于为资源树和它的元件定义某些属性。

source: The Resource Tree Preferences are used to define certain properties for how the resource tree and its elements function.
zh_cn: 资源树首选项 用于设置资源树及其元素功能的某些属性。

source: The Room Editor Preferences are used to define how the room editor will look and behave.
zh_cn: 房间编辑器偏好设置用于定义房间编辑器的外观和感受。

source: The Runtime Feeds Preferences are used to display and change the currently installed runtimes as well as the runtime in current use.
zh_cn: 运行库下载源偏好设置用来显示或更改当前已安装的运行库，也包括当前正在使用的运行库。

source: The Spline Editor Preferences are used primarily to define how the path editor looks and feels, although they will affect certain other aspects of the IDE (like the physics shape editor).
zh_cn: 样条曲线编辑器偏好设置主要用来定义路径编辑器的外观和感受，尽管也将会影响IDE的特定的其它方面（比如物理形状编辑器）。

source: The Sprite Editor Preferences are used to define how the Tile Set Editor looks and functions.
zh_cn: 精灵编辑器 首选项用于定义 图块集编辑器 的外观和功能。

source: The Sprite Editor Preferences are used to define how the sprite editor looks and functions.
zh_cn: 精灵编辑器 偏好设置用来定义精灵编辑器的外观和功能。

source: The Text Editors Preferences are used to define how the different code/script editors look and feel.
zh_cn: 文本编辑器偏好设置用来定义不同的代码/脚本编辑器的外观和感受。

source: The Timelines Preferences are used to define certain properties for when you are working with the timeline editor.
zh_cn: 时间轴首选项 用于设置使用 时间轴编辑器 时的某些属性。

source: The GameMaker Studio 2 IDE (integrated development environment) has a number of advanced options that are of great importance if you wish to get the most out of the product.
zh_cn: GameMaker Studio 2 的IDE （集成开发环境）拥有大量的高级选项，对于想要获得最大化的产品，它们都具有重要的意义。

source: The GameMaker Studio 2 IDE accepts mouse and keyboard input, and many operations can be carried out using one or the other or both.
zh_cn: GameMaker Studio 2 的IDE接受鼠标和键盘输入，并且你可以选择一个或另一个或者两者都用来实现更多操作。

source: The GameMaker Studio 2 IDE will periodically check for updates and then download them automatically.
zh_cn: GameMaker Studio 2 IDE会定期要求你检查更新，然后会自动下载。

source: The ds_map ID to use.
zh_cn: ds_map 的ID 。

source: The index.html can also be customised to show your game with a different background colour, or at a different position etc... but a knowledge of HTML is necessary for this, and you can also specify your own custom index file when you build the package (see the HTML5 Game Options).
zh_cn: index.html 也可以自定义，以不同的背景颜色或不同的位置来显示你的游戏，但是需要 HTML 的相关知识，你也可以在构建时指定自己的自定义索引文件包（请参阅 HTML5游戏选项）。

source: The Amazon Fire Android SDK path is misconfigured
zh_cn: Amazon Fire Android SDK 路径配置错误

source: The Android SDK path is misconfigured
zh_cn: Android SDK 路径配置错误

source: The Application Surface
zh_cn: 应用表面层

source: The Asset Explorer
zh_cn: 资产浏览器

source: The Asset Explorer Preferences
zh_cn: 资产浏览器偏好设置

source: The Asynchronous Events
zh_cn: 异步事件

source: The Background Preferences
zh_cn: 背景偏好设置

source: The Background preferences deal with the Workspace background and what it will display as well as how it will be displayed.
zh_cn: 背景偏好设置用于处理工作区的背景、显示什么背景以及背景如何去显示。

source: The Build Menu
zh_cn: 构建菜单（Build）

source: The Code Editor Preferences
zh_cn: 代码编辑器偏好设置

source: The Compiler Preferences
zh_cn: 编译器偏好设置

source: The Compiling preferences deal with certain options related to the output when compiling your game for testing or creating a package, as well as certain areas of the compiling process.
zh_cn: 编译器偏好设置用于处理某些在编译游戏以测试或创建程序包时和输出及编译处理的某些方面有关的选项。

source: The Confirm Dialogue preferences deal with some of the general confirmation pop-ups that will appear when performing certain actions in the GameMaker Studio 2 IDE.
zh_cn: 确认对话框偏好设置用于处理一些在GameMaker Studio 2 IDE中执行某些动作时的常规弹窗确认信息。

source: The Confirm Preferences
zh_cn: 确认偏好设置

source: The Current Package is missing.
zh_cn: 无法找到当前的程序包。

source: The DLL {0} on extension {1} with function {2} has more than 4 arguments and are not all the same type.
zh_cn: 扩展名为{1}且函数为{2}的DLL {0}具有4个以上的参数，并且类型不同。

source: The Debug Module
zh_cn: 调试模块

source: The Device Manager
zh_cn: 设备管理器

source: The Edit Menu
zh_cn: 编辑菜单（Edit）

source: The Editors
zh_cn: 编辑器

source: The Event cannot be changed to an existing Event.
zh_cn: 事件无法更改为现有事件。

source: The File Menu
zh_cn: 文件菜单（File）

source: The File System
zh_cn: 文件系统

source: The File Watcher scans the project folders for external changes - for example if you change a gml script in Notepad++ then the file watcher will detect this change and ask you if you want to reload it or discard it - and as such the frequency that this scan happens can severely impact performance and power consumption.
zh_cn: 文件监视器扫描项目文件夹的外部更改，例如，如果你使用 Notepad++ 修改了 GML 脚本，那么文件监视器会检测到此修改，并询问你是否要重新加载或者放弃 - 因此，扫描频率可能严重影响性能和功耗。

source: The Font Editor
zh_cn: 字体编辑器

source: The Free version has certain limitations but permits you to test out the most important features and prototype projects.
zh_cn: 试用版具有一些限制但是允许你体验我们最重要的特性和样例工程。

source: The Game Window
zh_cn: 游戏窗口

source: The Gesture Events
zh_cn: 手势事件

source: The Go To Preferences
zh_cn: 前往偏好设置

source: The Grid Settings preferences are used to set how the image grid will be presented, with the following options available:
zh_cn: 网格偏好设置（Grid Settings preferences ）被用于设置图像网格会如何显示，有如下可用选项：

source: The Help Menu
zh_cn: 帮助菜单（Help）

source: The Help Preferences
zh_cn: 帮助偏好设置

source: The ID of surface to be copied.
zh_cn: 被复制的表面层的ID。

source: The ID of the notification to cancel.
zh_cn: 被取消的通知的 ID 。

source: The ID of the surface to be copied.
zh_cn: 被复制的表面层的ID。

source: The ID of the surface to change.
zh_cn: 即将发生变化的表面层的ID。

source: The ID of the surface to check.
zh_cn: 检测的表面层索引。

source: The ID of the surface to copy the other surface to.
zh_cn: 从其它表面复制到的目的表面层的ID。

source: The ID of the surface to get the height of.
zh_cn: 将要获取高度的表面层ID。

source: The ID of the surface to get the width of.
zh_cn: 即将获取纹理的表面层ID。

source: The ID of the surface to set as the drawing target.
zh_cn: 作为绘制目标的表面层的ID。

source: The ID of the surface to use.
zh_cn: 使用的表面ID。

source: The ID of the surface.
zh_cn: 表面层的ID。

source: The Image Editor
zh_cn: 图像编辑器

source: The Image Editor Background Preferences
zh_cn: 图片编辑器的背景设置

source: The Image Editor Confirm Preferences
zh_cn: 图像编辑器的确认设置

source: The Image Editor Grid Settings Preferences
zh_cn: 图像编辑器的网格设置

source: The Image Editor Preferences
zh_cn: 图像编辑器的偏好设置

source: The Image Editor Preferences also has the following sub-categories:
zh_cn: 图像编辑器偏好设置中还有如下的子目录：

source: The Image Editor Tool Preferences
zh_cn: 图像编辑器的工具设置

source: The Input Preferences
zh_cn: 输入偏好设置

source: The Input preferences control certain aspects of the mouse and keyboard input within the IDE.
zh_cn: 输入偏好设置用于控制IDE中某些需要鼠标和键盘输入方面的控制。

source: The Language Preferences
zh_cn: 语言偏好设置

source: The Layouts Menu
zh_cn: 布局菜单（Layouts）

source: The Marketplace
zh_cn: 市场

source: The Marketplace Menu
zh_cn: 市场菜单（Marketplace）

source: The Marketplace New Certificate Window
zh_cn: 市场新证书窗口

source: The Marketplace Preferences
zh_cn: 市场的设置

source: The NOT operator is just what it says - NOT those bits.
zh_cn: “非” 运算就像它说的一样 - “非” 那些位。

source: The NX CPU Profiler can only be used on YYC builds.
zh_cn: NX CPU Profiler 只能用于YYC构建。

source: The NX CPU Profiler should not be enabled for Packaged builds
zh_cn: 程序包构建时无法启用 NX CPU Profiler

source: The Object Editor
zh_cn: 物体编辑器

source: The Object Editor Confirm Dialog Preferences
zh_cn: 物体编辑器确认对话框偏好设置

source: The Original Package is missing.
zh_cn: 无法找到原始程序包。

source: The Output Dock
zh_cn: 输出停靠栏

source: The Output Window Preferences
zh_cn: 输出窗口偏好设置

source: The Output Window preferences control the different colour and formatting options for the various different output windows in the IDE.
zh_cn: 输出窗口偏好设置控制着IDE中各个输出窗口的各种颜色和格式。

source: The Patch file is missing.
zh_cn: 无法找到补丁包文件。

source: The Path Preferences
zh_cn: 文件路径偏好设置

source: The Path preferences control the different file paths required by elements in the GameMaker Studio 2 IDE as well as for any external editors that you require.
zh_cn: 文件路径偏好设置（Path Preference）用于控制GameMaker Studio 2中的一些要素以及你所要求的外部编辑器（External Editors）所需的各种文件路径。

source: The Physics World
zh_cn: 物理世界

source: The Power Saving Preferences
zh_cn: 节能偏好设置

source: The Power Saving preferences here will affect how much CPU power and GPU power will be used to generate the GameMaker Studio 2 IDE (essentially this will lower the base framerate at which the program runs and so lower power consumption).
zh_cn: 节能偏好设置（Power Saving Preferences）将会影响生成 GameMaker Studio 2 IDE 所使用的 CPU 及 GPU 功率（必要时这些设置会在程序运行时降低基本帧率及功耗）。

source: The Projects section is where you can create, open or import projects.
zh_cn: 你可以在工程部分创建、打开或导入项目。

source: The Repository '{0}' is expecting a different Username/Password than is set under the Identity preferences.
zh_cn: 存储库 '{0}' 期望一个与身份偏好设置不同的用户名/密码。

source: The Repository is expecting a different Username/Password than is set under the Identity preferences.
zh_cn: 项目库需要一个与标识设置(?)不同的用户名/密码。

source: The Resource Tree Confirm Dialog Preferences
zh_cn: 资源树确认对话框偏好设置

source: The Resource Tree Preferences
zh_cn: 资源树偏好设置

source: The Resources Preferences
zh_cn: 资源偏好设置

source: The Room Editor Confirm Dialogs Preferences
zh_cn: 房间编辑器确认对话框偏好设置

source: The Room Editor Grid Settings Preferences
zh_cn: 房间编辑器网格设置偏好

source: The Room Editor Preferences
zh_cn: 房间编辑器偏好设置

source: The Runtime Feed List
zh_cn: 运行库下载源列表

source: The Runtime Feed Master Preferences
zh_cn: 运行库主下载源偏好设置

source: The Runtime Feeds Preferences
zh_cn: 运行库下载源偏好设置

source: The Runtime Install Section
zh_cn: 运行库安装部分

source: The SDK Build Settings are invalid
zh_cn: SDK 构建设置无效

source: The Sandbox
zh_cn: 文件沙箱

source: The Spline Editor Preferences
zh_cn: 样条曲线编辑器偏好设置

source: The Sprite Editor Confirm Dialog Preferences
zh_cn: 精灵编辑器确认对话框偏好设置

source: The Sprite Editor Preferences
zh_cn: 精灵编辑器偏好设置

source: The Start Page
zh_cn: 起始页

source: The Text Editor Colour Preferences
zh_cn: 文本编辑器颜色偏好设置

source: The Texture Group for sprite '{0}' is invalid - setting to Default Texture Group instead
zh_cn: 精灵纹理组 '{0}' 无效 - 使用默认纹理组代替

source: The Tile Set Editor preferences also has a Confirm Dialogs sub-section:
zh_cn: “图块集编辑器” 首选项还有 确认对话框 子部分：

source: The Tools Menu
zh_cn: 工具菜单（Tools）

source: The Trial Licence has certain limitations but permits you to test out the most important features and prototype projects.
zh_cn: 试用版具有一些限制但是允许你体验我们最重要的特性和样例工程。

source: The URL is invalid
zh_cn: URL无效

source: The URL or IP to connect to (a string).
zh_cn: 待连接的URL或IP（字符串形式）。

source: The URL to get the IP of (a string).
zh_cn: 待获取IP的URL（字符串形式）。

source: The UWP target comes with two compile options, one is the VM that uses a runner and interpreted code and the other which is the YYC (YoYo Compiler) which creates native code and a compiled executable.
zh_cn: UWP 平台带有两个编译选项，一个是 VM（虚拟机） ，它使用一个运行器来解释代码，另一个是 YYC（YoYo 编译器） ，创建本机代码并编译可执行程序。

source: The Web Server will show a certain amount of debug information related to the files that have been served, and has a button to clear this at the bottom.
zh_cn: 这个网络服务器会显示一定量的与所伺服文件相关的调试信息，以及底部的一个用来清空这些信息的按钮。

source: The Windows Menu
zh_cn: 窗口菜单（Windows）

source: The Workspace Preferences
zh_cn: 工作区偏好设置

source: The YoYo runner also benefits from a special command line parameter:
zh_cn: YoYo runner 还受益于一个特殊的命令行参数：

source: The above code check for a key press and the toggle the application surface on or off depending on its state (like in an options menu).
zh_cn: 上述代码检测按键并根据它的状态切换应用表面的启用(就像菜单的选项)。

source: The above code checks for a key press and if it detects one it frees the memory reserved for the surface indexed in the variable "surf" and then changes room.
zh_cn: 上述代码将检测一个键是否按下，如果检测到了，则对索引为变量surf的表面图层所预留的那部分内存进行释放，然后切换一个房间。

source: The above code checks for a mouse button press and then sets the window to fullscreen if it is not already, or sets it to windowed if it is already.
zh_cn: 上述代码将检测鼠标按下，如果还不是全屏则设置窗口为全屏，否则在已经是全屏模式时设置为窗口。

source: The above code checks the orientation of the device and sets a global variable depending on the value returned.
zh_cn: 上述代码检测设备的取向，根据返回值设置一个全局变量。

source: The above code checks the variable "val" to see if it contains a pointer and if it does not then one is assigned to it.
zh_cn: 上述代码将会检测变量“val”来观察它是否存储一个指针，如果不是则将一个指针赋予给它。

source: The above code checks to make sure that the correct asynchronous function call is being revised, then goes on to get the status of the returned cloud ds_map.
zh_cn: 上面的代码通过检查以确保异步调用的函数正确性，然后返回云端 ds_map 的 status。

source: The above code checks to see if a surface exists and if it does not it will create a surface that is 1024 pixels wide and 1024 pixels high, assigning the index to the variable "surf".
zh_cn: 上述代码将检测是否存在一个表面图层，如果没有则创建一个1024×1024px大小的表面图层，并指定给索引为变量“surf”。

source: The above code checks to see if view[0] is visible or not and if it is not, it then sets it to be visible.
zh_cn: 上述代码检测 view[0] 是否可见，如果不可见，则设置为可见。

source: The above code checks to see which view is currently being drawn and then draws a different text to each view based on the return value.
zh_cn: 上述代码将基于返回值检测当前绘制的是哪个视野并绘制不同的文字。

source: The above code creates a ds_map and then requests data for the first available notification in the queue.
zh_cn: 上面的代码创建了一个 ds_map ，然后请求数据队列中第一个可用的通知。

source: The above code creates a new ds_grid, based on the width and height of a previously created grid, then copies the information form the previous grid to the new one.
zh_cn: 上述代码创建了一个新的栅格结构，基于先前创建的栅格的宽度和高度，然后从先前的栅格中拷贝信息给新的栅格。

source: The above code creates a string from the values stored in the global array "Highscores" and then writes this string to a file for local storage.
zh_cn: 以上的代码创建了一个字符串的值存储在全局数组“Highscores”中,然后将该字符串写入本地存储。

source: The above code creates a string from the values stored in the global array "Highscores" and then writes this string to the cloud service for storage, as well as writing it to a file for local storage.
zh_cn: 以上的代码创建了一个字符串的值存储在全局数组“Highscores”中,然后将该字符串写入存储的云服务中,并且在本地文件中保存了一份。

source: The above code creates two surfaces of different sizes, assigning each one to a different canvas element, and then those surfaces are assigned to two views so that the correct part of the room is captured.
zh_cn: 上述代码创建了两个不同大小的表面，并给他们每个都指定了不同的画布元素，然后为了在房间里捕捉正确的部分，给这两个表面层指定了两个视野。

source: The above code first checks the current draw alpha and then if it is not set to 1 it sets it to 1.
zh_cn: 上述代码首先检测当前绘制透明度，当其不为1时，将其设为1。

source: The above code gets the hue used to make the colour constant "c_teal" and then merges it with white at a 50:50 ratio, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取颜色常量 "c_teal"的色相，然后将其与白色按照50:50的比例混合，并且将混合后的新颜色储存到变量 "col"中。

source: The above code gets the saturation used to make the colour constant "c_teal" and then uses that value to set a random colour to have the same saturation, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取常量 "c_teal"的饱和度，然后使用这个饱和度与一个随机的颜色相搭配，并且将得到新颜色储存到变量 "col"中。

source: The above code gets the value used to make the colour constant "c_teal" and then uses that value to set a random colour to have the same luminosity, storing the resulting colour in the variable "col".
zh_cn: 上述代码获取常量 "c_teal"的明度，然后使用这个明度与一个随机的颜色相搭配，并且将得到新颜色储存到变量 "col"中。

source: The above code resets the position of view port[0] to the (0,0) position (top left hand corner) of the display.
zh_cn: 上述代码将重设view port[0]（视口）的位置为 显示器的(0,0)位置 (左上角)。

source: The above code stores the current action number in the variable "num".
zh_cn: 上述代码将当前所执行动作的索引存入变量“num”中。

source: The above code stores the current x axis window position in the variable "wx".
zh_cn: 上述代码储存当前窗口位置的x坐标至变量wx。

source: The above code stores the current x axis window position of the mouse in the variable "wx".
zh_cn: 上述代码使用变量"wx"记录了鼠标在窗口中的x轴位置。

source: The above code stores the current y axis window position in the variable "wy".
zh_cn: 上述代码储存当前窗口位置的y坐标至变量wy。

source: The above code stores the current y axis window position of the mouse in the variable "wy".
zh_cn: 上述代码使用变量"wy"记录了鼠标在窗口中的y轴位置。

source: The above code takes a screenshot of a part of the game screen that is 100 pixels square when the user presses the "S" key.
zh_cn: 上述代码在按下“S”键时将游戏屏幕边长100像素的正方形区域保存为截图。

source: The above code takes a screenshot of the game when the user presses the "S" key.
zh_cn: 上述代码在按下“S”键时保存游戏屏幕截图。

source: The above code uses the argument_count variable to initialize variables, and is an example of how to permit a script to accept a variable number of arguments.
zh_cn: 上述代码使用argument_count变量来初始化变量，并示范了如何允许脚本接收可变数量的参数。

source: The above code will add up all the values in our array, draw each of them and draw the total value at the end.
zh_cn: 这段程序将数组中的数据依次累加，并绘制数组的值每个值，最后绘制累加的总和。

source: The above code will burst a random number of particles between 30 and 60 from the chosen emitter.
zh_cn: 上述代码会从所选发射器迸发30到60个随机数量的粒子。

source: The above code will center the game window within the display if it is not in full screen mode.
zh_cn: 在不是全屏模式下的情况下，让游戏窗口屏幕居中放置。

source: The above code will change the size of the window based on the value of the variable "global.scale" when the mouse button is pressed.
zh_cn: 上述代码将在鼠标按下时，基于变量“global.scale”改变窗口的大小。

source: The above code will change the window cursor to the standard windows drag cursor if the left mouse button has been pressed and it has not already been changed previously.
zh_cn: 如果之前不是拖放指针，上述代码将在按下鼠标左键时切换窗口鼠标指针为拖放指针。

source: The above code will change the window cursor to the standard windows drag cursor if the left mouse button has been pressed.
zh_cn: 上述代码在鼠标左键按下时改变窗口光标为拖动光标。

source: The above code will check for a mouse button being pressed, and if it is it then gets the mouse position relative to the view[0] and compares it to see if a variable should be set to true.
zh_cn: 上述代码将检测鼠标是否按下，如果是，然后它会获取相对于视野0（view[0]）的鼠标位置，并且比较它的值，看是否应该设置为真。

source: The above code will check the current geometry method and set it to "fast" if it is not already.
zh_cn: 上述代码将检测当前的几何顶点缓冲区的方法，如果没有准备好则设置为 “fast（vbm_fast 方法）”。

source: The above code will check the current view being drawn and if it is view[0] it copies the surface indexed in the variable "temp_surf" onto the surface indexed in the variable "surf".
zh_cn: 上述代码将检测当前绘制的视野，如果视野是 view[0]，则复制变量为 "temp_surf" 的表面到变量为 "surf"的表面。

source: The above code will check the view port size against that of the surface "aplication_surface" and if it is different, the surface is re-sized.
zh_cn: 上述代码将检测视野输出大小是否与“应用表面”的一致，如果不同，将重置表面层的大小。

source: The above code will check the window colour to see if it is set as black or not, and if it is not it sets it to black.
zh_cn: 上述代码检测窗口内背景颜色，如果不是黑色则设置为黑色。

source: The above code will check the windows caption to see if it has text or not, and if it does it sets it to an empty string so as no caption is displayed.
zh_cn: 上述代码检测窗口是否有标题文字，如果有则设置为空，即不显示标题。

source: The above code will check to see if a global variable exists and if it does then it is output to the console.
zh_cn: 上述代码会检测一个全局变量是否存在，若存在将其输出到控制台上。

source: The above code will check to see if a surface indexed in the variable "surf" exists, and if it does not, it will re-create it.
zh_cn: 上面的例子中将检测变量为 "surf"的表面图层是否存在，如果不存在，将重新创建一个。

source: The above code will check to see if the game window is in focus or not, and if the function returns false a script will be called.
zh_cn: 上述代码将会检测游戏窗口是否处于焦点，若为false则调用一个脚本。

source: The above code will check to see if the global variable called "enemy_num" exists and if it does not it is created and set a value.
zh_cn: 上述代码将会检测名字叫"enemy_num"的全局变量是否存在，如果不存在则创建这样的全局变量并为其设定一个值。

source: The above code will check to see if the user presses the "S" key on the keyboard and if they do it will save a part of the surface indexed in the variable "surf" to disc.
zh_cn: 上面的代码将检查是否用户按下键盘上的“S”键，如果他们这样操作了，将对变量“surf”索引的表面层的一部分进行存盘保存。

source: The above code will check to see if the user presses the "S" key on the keyboard and if they do it will save the surface indexed in the variable "surf" to disc.
zh_cn: 上面的代码将检查是否用户按下键盘上的“S”键，如果他们这样操作了，将对变量“surf”索引的表面层存盘保存。

source: The above code will check to see if the v-sync method is using the alternative or the default, and if it's the default it will switch to the alternative instead.
zh_cn: 上述代码检测是否使用于替代的垂直同步方法，如果是默认的则切换为替代的方法。

source: The above code will check to see if the window is in full screen mode or not and draw a text message depending on the returned value.
zh_cn: 上述代码将检测是否为窗口模式，根据返回的值绘制文字。
